virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/atsama5d27cld2g.h
/** \addtogroup SAMA5D27CLD2G_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR SAMA5D27CLD2G                 */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define ACC_REGS                         ((acc_registers_t*)0xf804a000)                /**< \brief ACC Registers Address        */
#define ADC_REGS                         ((adc_registers_t*)0xfc030000)                /**< \brief ADC Registers Address        */
#define AES_REGS                         ((aes_registers_t*)0xf002c000)                /**< \brief AES Registers Address        */
#define AESB_REGS                        ((aesb_registers_t*)0xf001c000)               /**< \brief AESB Registers Address       */
#define AIC_REGS                         ((aic_registers_t*)0xfc020000)                /**< \brief AIC Registers Address        */
#define SAIC_REGS                        ((aic_registers_t*)0xf803c000)                /**< \brief SAIC Registers Address       */
#define AXIMX_REGS                       ((aximx_registers_t*)0x00600000)              /**< \brief AXIMX Registers Address      */
#define CHIPID_REGS                      ((chipid_registers_t*)0xfc069000)             /**< \brief CHIPID Registers Address     */
#define CLASSD_REGS                      ((classd_registers_t*)0xfc048000)             /**< \brief CLASSD Registers Address     */
#define FLEXCOM0_REGS                    ((flexcom_registers_t*)0xf8034000)            /**< \brief FLEXCOM0 Registers Address   */
#define FLEXCOM1_REGS                    ((flexcom_registers_t*)0xf8038000)            /**< \brief FLEXCOM1 Registers Address   */
#define FLEXCOM2_REGS                    ((flexcom_registers_t*)0xfc010000)            /**< \brief FLEXCOM2 Registers Address   */
#define FLEXCOM3_REGS                    ((flexcom_registers_t*)0xfc014000)            /**< \brief FLEXCOM3 Registers Address   */
#define FLEXCOM4_REGS                    ((flexcom_registers_t*)0xfc018000)            /**< \brief FLEXCOM4 Registers Address   */
#define GMAC_REGS                        ((gmac_registers_t*)0xf8008000)               /**< \brief GMAC Registers Address       */
#define I2SC0_REGS                       ((i2sc_registers_t*)0xf8050000)               /**< \brief I2SC0 Registers Address      */
#define I2SC1_REGS                       ((i2sc_registers_t*)0xfc04c000)               /**< \brief I2SC1 Registers Address      */
#define ICM_REGS                         ((icm_registers_t*)0xf8040000)                /**< \brief ICM Registers Address        */
#define ISC_REGS                         ((isc_registers_t*)0xf0008000)                /**< \brief ISC Registers Address        */
#define L2CC_REGS                        ((l2cc_registers_t*)0x00a00000)               /**< \brief L2CC Registers Address       */
#define LCDC_REGS                        ((lcdc_registers_t*)0xf0000000)               /**< \brief LCDC Registers Address       */
#define MATRIX0_REGS                     ((matrix_registers_t*)0xf0018000)             /**< \brief MATRIX0 Registers Address    */
#define MATRIX1_REGS                     ((matrix_registers_t*)0xfc03c000)             /**< \brief MATRIX1 Registers Address    */
#define MCAN0_REGS                       ((mcan_registers_t*)0xf8054000)               /**< \brief MCAN0 Registers Address      */
#define MCAN1_REGS                       ((mcan_registers_t*)0xfc050000)               /**< \brief MCAN1 Registers Address      */
#define MPDDRC_REGS                      ((mpddrc_registers_t*)0xf000c000)             /**< \brief MPDDRC Registers Address     */
#define PDMIC_REGS                       ((pdmic_registers_t*)0xf8018000)              /**< \brief PDMIC Registers Address      */
#define PIO_REGS                         ((pio_registers_t*)0xfc038000)                /**< \brief PIO Registers Address        */
#define PIT_REGS                         ((pit_registers_t*)0xf8048030)                /**< \brief PIT Registers Address        */
#define PMC_REGS                         ((pmc_registers_t*)0xf0014000)                /**< \brief PMC Registers Address        */
#define PTC_REGS                         ((ptc_registers_t*)0xfc060000)                /**< \brief PTC Registers Address        */
#define PWM_REGS                         ((pwm_registers_t*)0xf802c000)                /**< \brief PWM Registers Address        */
#define QSPI0_REGS                       ((qspi_registers_t*)0xf0020000)               /**< \brief QSPI0 Registers Address      */
#define QSPI1_REGS                       ((qspi_registers_t*)0xf0024000)               /**< \brief QSPI1 Registers Address      */
#define RSTC_REGS                        ((rstc_registers_t*)0xf8048000)               /**< \brief RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0xf80480b0)                /**< \brief RTC Registers Address        */
#define RXLP_REGS                        ((rxlp_registers_t*)0xf8049000)               /**< \brief RXLP Registers Address       */
#define SCKC_REGS                        ((sckc_registers_t*)0xf8048050)               /**< \brief SCKC Registers Address       */
#define SDMMC0_REGS                      ((sdmmc_registers_t*)0xa0000000)              /**< \brief SDMMC0 Registers Address     */
#define SDMMC1_REGS                      ((sdmmc_registers_t*)0xb0000000)              /**< \brief SDMMC1 Registers Address     */
#define SECUMOD_REGS                     ((secumod_registers_t*)0xfc040000)            /**< \brief SECUMOD Registers Address    */
#define SFC_REGS                         ((sfc_registers_t*)0xf804c000)                /**< \brief SFC Registers Address        */
#define SFR_REGS                         ((sfr_registers_t*)0xf8030000)                /**< \brief SFR Registers Address        */
#define SFRBU_REGS                       ((sfrbu_registers_t*)0xfc05c000)              /**< \brief SFRBU Registers Address      */
#define SHA_REGS                         ((sha_registers_t*)0xf0028000)                /**< \brief SHA Registers Address        */
#define SHDWC_REGS                       ((shdwc_registers_t*)0xf8048010)              /**< \brief SHDWC Registers Address      */
#define HSMC_REGS                        ((smc_registers_t*)0xf8014000)                /**< \brief SMC Registers Address        */
#define SPI0_REGS                        ((spi_registers_t*)0xf8000000)                /**< \brief SPI0 Registers Address       */
#define SPI1_REGS                        ((spi_registers_t*)0xfc000000)                /**< \brief SPI1 Registers Address       */
#define SSC0_REGS                        ((ssc_registers_t*)0xf8004000)                /**< \brief SSC0 Registers Address       */
#define SSC1_REGS                        ((ssc_registers_t*)0xfc004000)                /**< \brief SSC1 Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0xf800c000)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0xf8010000)                 /**< \brief TC1 Registers Address        */
#define TDES_REGS                        ((tdes_registers_t*)0xfc044000)               /**< \brief TDES Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0xfc01c000)               /**< \brief TRNG Registers Address       */
#define TWIHS0_REGS                      ((twihs_registers_t*)0xf8028000)              /**< \brief TWIHS0 Registers Address     */
#define TWIHS1_REGS                      ((twihs_registers_t*)0xfc028000)              /**< \brief TWIHS1 Registers Address     */
#define UART0_REGS                       ((uart_registers_t*)0xf801c000)               /**< \brief UART0 Registers Address      */
#define UART1_REGS                       ((uart_registers_t*)0xf8020000)               /**< \brief UART1 Registers Address      */
#define UART2_REGS                       ((uart_registers_t*)0xf8024000)               /**< \brief UART2 Registers Address      */
#define UART3_REGS                       ((uart_registers_t*)0xfc008000)               /**< \brief UART3 Registers Address      */
#define UART4_REGS                       ((uart_registers_t*)0xfc00c000)               /**< \brief UART4 Registers Address      */
#define UDPHS_REGS                       ((udphs_registers_t*)0xfc02c000)              /**< \brief UDPHS Registers Address      */
#define WDT_REGS                         ((wdt_registers_t*)0xf8048040)                /**< \brief WDT Registers Address        */
#define XDMAC0_REGS                      ((xdmac_registers_t*)0xf0010000)              /**< \brief XDMAC0 Registers Address     */
#define XDMAC1_REGS                      ((xdmac_registers_t*)0xf0004000)              /**< \brief XDMAC1 Registers Address     */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

