virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/atsama5d27cld2g.h
/** \addtogroup SAMA5D27CLD2G_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAMA5D27CLD2G                                        */
/* ************************************************************************** */
#include "pio/sama5d27cld2g.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAMA5D27CLD2G                             */
/* ************************************************************************** */

#define EBI_CS0_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define DDR_CS_SIZE                    _UL_(0x20000000)    /* 524288kB Memory segment type: other */
#define DDR_AES_CS_SIZE                _UL_(0x20000000)    /* 524288kB Memory segment type: other */
#define EBI_CS1_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define EBI_CS2_SIZE                   _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define EBI_CS3_SIZE                   _UL_(0x08000000)    /* 131072kB Memory segment type: other */
#define QSPI_AES0_SIZE                 _UL_(0x08000000)    /* 131072kB Memory segment type: other */
#define QSPI_AES1_SIZE                 _UL_(0x08000000)    /* 131072kB Memory segment type: other */
#define SDMMC0_SIZE                    _UL_(0x00001000)    /*    4kB Memory segment type: other */
#define SDMMC1_SIZE                    _UL_(0x00001000)    /*    4kB Memory segment type: other */
#define NFC_SIZE                       _UL_(0x10000000)    /* 262144kB Memory segment type: other */
#define QSPI0MEM_SIZE                  _UL_(0x08000000)    /* 131072kB Memory segment type: other */
#define QSPI1MEM_SIZE                  _UL_(0x08000000)    /* 131072kB Memory segment type: other */
#define PERIPHERALS_SIZE               _UL_(0x10000000)    /* 262144kB Memory segment type: io */
#define IROM_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: rom */
#define ECC_ROM_SIZE                   _UL_(0x00018000)    /*   96kB Memory segment type: other */
#define NFC_RAM_SIZE                   _UL_(0x00002400)    /*    9kB Memory segment type: other */
#define SRAM0_SIZE                     _UL_(0x00020000)    /*  128kB Memory segment type: other */
#define SRAM1_SIZE                     _UL_(0x00020000)    /*  128kB Memory segment type: other */
#define UDPHS_RAM_SIZE                 _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define UHPHS_OHCI_SIZE                _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define UHPHS_EHCI_SIZE                _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define AXIMX_SIZE                     _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define DAP_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define PTCMEM_SIZE                    _UL_(0x00100000)    /* 1024kB Memory segment type: other */
#define SECURAM_SIZE                   _UL_(0x00004000)    /*   16kB Memory segment type: other */

#define EBI_CS0_ADDR                   _UL_(0x10000000)    /**< EBI_CS0 base address (type: other)*/
#define DDR_CS_ADDR                    _UL_(0x20000000)    /**< DDR_CS base address (type: other)*/
#define DDR_AES_CS_ADDR                _UL_(0x40000000)    /**< DDR_AES_CS base address (type: other)*/
#define EBI_CS1_ADDR                   _UL_(0x60000000)    /**< EBI_CS1 base address (type: other)*/
#define EBI_CS2_ADDR                   _UL_(0x70000000)    /**< EBI_CS2 base address (type: other)*/
#define EBI_CS3_ADDR                   _UL_(0x80000000)    /**< EBI_CS3 base address (type: other)*/
#define QSPI_AES0_ADDR                 _UL_(0x90000000)    /**< QSPI_AES0 base address (type: other)*/
#define QSPI_AES1_ADDR                 _UL_(0x98000000)    /**< QSPI_AES1 base address (type: other)*/
#define SDMMC0_ADDR                    _UL_(0xa0000000)    /**< SDMMC0 base address (type: other)*/
#define SDMMC1_ADDR                    _UL_(0xb0000000)    /**< SDMMC1 base address (type: other)*/
#define NFC_ADDR                       _UL_(0xc0000000)    /**< NFC base address (type: other)*/
#define QSPI0MEM_ADDR                  _UL_(0xd0000000)    /**< QSPI0MEM base address (type: other)*/
#define QSPI1MEM_ADDR                  _UL_(0xd8000000)    /**< QSPI1MEM base address (type: other)*/
#define PERIPHERALS_ADDR               _UL_(0xf0000000)    /**< PERIPHERALS base address (type: io)*/
#define IROM_ADDR                      _UL_(0x00000000)    /**< IROM base address (type: rom)*/
#define ECC_ROM_ADDR                   _UL_(0x00040000)    /**< ECC_ROM base address (type: other)*/
#define NFC_RAM_ADDR                   _UL_(0x00100000)    /**< NFC_RAM base address (type: other)*/
#define SRAM0_ADDR                     _UL_(0x00200000)    /**< SRAM0 base address (type: other)*/
#define SRAM1_ADDR                     _UL_(0x00220000)    /**< SRAM1 base address (type: other)*/
#define UDPHS_RAM_ADDR                 _UL_(0x00300000)    /**< UDPHS_RAM base address (type: other)*/
#define UHPHS_OHCI_ADDR                _UL_(0x00400000)    /**< UHPHS_OHCI base address (type: other)*/
#define UHPHS_EHCI_ADDR                _UL_(0x00500000)    /**< UHPHS_EHCI base address (type: other)*/
#define AXIMX_ADDR                     _UL_(0x00600000)    /**< AXIMX base address (type: other)*/
#define DAP_ADDR                       _UL_(0x00700000)    /**< DAP base address (type: other)*/
#define PTCMEM_ADDR                    _UL_(0x00800000)    /**< PTCMEM base address (type: other)*/
#define SECURAM_ADDR                   _UL_(0xf8044000)    /**< SECURAM base address (type: other)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR SAMA5D27CLD2G                                      */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UL_(0X05B3F03F)
#define CHIP_CIDR                      _UL_(0X8A5C08C2)
#define CHIP_EXID                      _UL_(0X00000062)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR SAMA5D27CLD2G                                 */
/* ************************************************************************** */



#ifdef __cplusplus
}
#endif

/** @}  end of SAMA5D27CLD2G definitions */


#endif /* _SAMA5D27CLD2G_H_ */

